<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Sketch media player.</string>
	<key>Identifier</key>
	<string>com.github.aitorhergon.autopkg.download.sketch</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Sketch</string>
		<key>NAME</key>
		<string>Sketch</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.sketch.com/sketch-versions.xml</string>
                <key>re_pattern</key>
				<string>https:\/\/download\.sketch\.com\/sketch-([\d\.]+)-[\d\.]+.zip</string>
                <key>result_output_var_name</key>
                <string>version1</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.sketch.com/sketch-versions.xml</string>
                <key>re_pattern</key>
				<string>https:\/\/download\.sketch\.com\/sketch-[\d\.]+-([\d\.]+).zip</string>
                <key>result_output_var_name</key>
                <string>version2</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.sketch.com/sketch-%version1%-%version2%.zip</string>
                <key>filename</key>
                <string>%NAME%-%version1%-%version2%.zip</string>
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Sketch.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.bohemiancoding.sketch3" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = WUGMZZ5K46)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Sketch.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
