<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Font Agent 10 media player.</string>
	<key>Identifier</key>
	<string>com.github.aitorhergon.autopkg.download.fontagent</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Font Agent 10</string>
		<key>NAME</key>
		<string>Font Agent 10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://store.insidersoftware.com/_downloads/FontAgent10.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
    <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
      <dict>
			<key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>Double-click to install FontAgent.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <key>user</key>
                    <string>root</string>
                    <key>group</key>
                    <string>wheel</string>
                    <key>mode</key>
                    <string>0755</string>
                  </dict>
                </array>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/Double-click to install FontAgent.pkg</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Insider Software Inc. (936VDEB3YQ)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
	</array>
</dict>
</plist>
