<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Oxygen XML Editor.</string>
	<key>Identifier</key>
	<string>com.github.aitorhergon.autopkg.download.oxygen</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Oxygen XML Editor</string>
		<key>NAME</key>
		<string>Oxygen XML Editor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://mirror.oxygenxml.com/InstData/Editor/MacOSX/VM/oxygen-openjdk.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>Oxygen XML Editor</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <key>user</key>
                    <string>administrador</string>
                    <key>group</key>
                    <string>staff</string>
                    <key>mode</key>
                    <string>0755</string>
                  </dict>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%/Oxygen XML Editor.app</string>
				<key>requirement</key>
				<string>always</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%/Oxygen XML Editor.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
