<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of oxygen.</string>
	<key>Identifier</key>
	<string>com.github.aitorhergon.autopkg.download.oxygen</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Oxygen XML Editor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://mirror.oxygenxml.com/InstData/Editor/MacOSX/VM/oxygen-openjdk.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Oxygen XML Editor/*</string>
				<key>requirement</key>
				<string>certificate leaf[subject.OU] = "ADUZ46XWHJ"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		</dict>
	</array>
</dict>
</plist>
