<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Wacom media player.</string>
	<key>Identifier</key>
	<string>com.github.aitorhergon.autopkg.download.wacom</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Wacom</string>
		<key>NAME</key>
		<string>Wacom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wacom.com/es-es/support/product-support/drivers</string>
                <key>re_pattern</key>
				<string>https:\/\/cdn\.wacom\.com\/u\/productsupport\/drivers\/mac\/professional\/WacomTablet_[0-9a-z\.]+\-[0-9a-z\.]+\.dmg</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
      <dict>
			<key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>Install Wacom Tablet.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <key>user</key>
                    <string>root</string>
                    <key>group</key>
                    <string>wheel</string>
                    <key>mode</key>
                    <string>0755</string>
                  </dict>
                </array>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/Install Wacom Tablet.pkg</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Wacom Technology Corp. (EG27766DY7)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
	</array>
</dict>
</plist>
